In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame( {'k1':['X','X','Y','Y','Z'],
                     'k2':['alpha','beta','alpha','beta','alpha'],
                     'dataset1':np.random.randn(5),
                     'dataset2':np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  1.511973  0.207367
1  X   beta  0.610458  0.066191
2  Y  alpha  0.600971  0.675397
3  Y   beta  0.067071  1.655493
4  Z  alpha  0.907863  1.148299

In [3]:
# create a series groupby object
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [4]:
group1

In [5]:
group1.mean()

k1
X    1.061216
Y    0.334021
Z    0.907863
Name: dataset1, dtype: float64

In [6]:
cities = np.array(['NY','LA','LA','NY','NY'])

In [7]:
months = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [9]:
dframe['dataset1'].groupby([cities,months]).mean()

LA  FEB    0.610458
    JAN    0.600971
NY  FEB    0.067071
    JAN    1.209918
Name: dataset1, dtype: float64

In [10]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  1.511973  0.207367
1  X   beta  0.610458  0.066191
2  Y  alpha  0.600971  0.675397
3  Y   beta  0.067071  1.655493
4  Z  alpha  0.907863  1.148299

In [11]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   1.061216  0.136779
Y   0.334021  1.165445
Z   0.907863  1.148299

In [12]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  1.511973  0.207367
   beta   0.610458  0.066191
Y  alpha  0.600971  0.675397
   beta   0.067071  1.655493
Z  alpha  0.907863  1.148299

In [13]:
dframe.groupby('k1').size()

k1
X    2
Y    2
Z    1
dtype: int64

In [16]:
 # iterate over groups
for name,group in dframe.groupby('k1'):
    print('this is the group', name)
    print(group)
    print()

this is the group X
  k1     k2  dataset1  dataset2
0  X  alpha  1.511973  0.207367
1  X   beta  0.610458  0.066191

this is the group Y
  k1     k2  dataset1  dataset2
2  Y  alpha  0.600971  0.675397
3  Y   beta  0.067071  1.655493

this is the group Z
  k1     k2  dataset1  dataset2
4  Z  alpha  0.907863  1.148299

In [21]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print('key1 =', k1, '|', 'key2 = ', k2)
    print(group)
    print()

key1 = X | key2 =  alpha
  k1     k2  dataset1  dataset2
0  X  alpha  1.511973  0.207367

key1 = X | key2 =  beta
  k1    k2  dataset1  dataset2
1  X  beta  0.610458  0.066191

key1 = Y | key2 =  alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  0.600971  0.675397

key1 = Y | key2 =  beta
  k1    k2  dataset1  dataset2
3  Y  beta  0.067071  1.655493

key1 = Z | key2 =  alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  0.907863  1.148299

In [19]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  1.511973  0.207367
1  X   beta  0.610458  0.066191
2  Y  alpha  0.600971  0.675397
3  Y   beta  0.067071  1.655493
4  Z  alpha  0.907863  1.148299

In [22]:
group_dict = dict(list(dframe.groupby('k1')))

In [23]:
group_dict

{'X':   k1     k2  dataset1  dataset2
 0  X  alpha  1.511973  0.207367
 1  X   beta  0.610458  0.066191, 'Y':   k1     k2  dataset1  dataset2
 2  Y  alpha  0.600971  0.675397
 3  Y   beta  0.067071  1.655493, 'Z':   k1     k2  dataset1  dataset2
 4  Z  alpha  0.907863  1.148299}

In [25]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  1.511973  0.207367
1  X   beta  0.610458  0.066191

In [26]:
group_dict_axis = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [27]:
group_dict_axis

{dtype('float64'):    dataset1  dataset2
 0  1.511973  0.207367
 1  0.610458  0.066191
 2  0.600971  0.675397
 3  0.067071  1.655493
 4  0.907863  1.148299, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [44]:
#groupby with cols
d2_group = dframe.groupby(['k1','k2'])[['dataset2']]
d2_group.mean()

          dataset2
k1 k2
X  alpha  0.207367
   beta   0.066191
Y  alpha  0.675397
   beta   1.655493
Z  alpha  1.148299